

TEST_INFO_TEXT = """Ця програма дозволить вам за допомогою тесту Руф'є провести первинну діагностику вашого здоров'я.
Проба Руф'є є навантажувальним комплексом, призначеним для оцінки працездатності серця при фізичному навантаженні.
У випробуваного, що знаходиться в положенні лежачи на спині протягом 5 хв, визначають частоту пульсу за 15 секунд; 
потім протягом 45 секунд випробуваний виконує 30 присідань.
Після закінчення навантаження випробуваний лягає, і в нього знову підраховується кількість пульсацій за перші 15 секунд, 
А потім — за останні 15 секунд першої хвилини періоду відновлення.
Важливо! Якщо в процесі проведення випробування ви відчуєте себе погано (з'явиться запаморочення, шум вухах, сильна задишка та ін.),
то тест необхідно перервати і звернутися до лікаря.
"""

# commit - збереження змін в проекті, з повідомленням 


TIMER_FOR_FIRST_TEST = 15


btn_style = """
            QPushButton {
                background-color: #3498db;
                color: white;
                font-size: 16px;
                font-family: "Segoe UI", Arial, sans-serif;
                border-style: solid;
                border-width: 2px;
                border-color: #2980b9;
                border-radius: 8px;
                padding: 10px 20px;
                min-width: 120px;
            }
            
            QPushButton:hover {
                background-color: #2980b9;
                border-color: #1f618d;
            }
            
            QPushButton:pressed {
                background-color: #1f618d;
                border-color: #154360;
                padding-left: 12px;
                padding-top: 12px;
            }
        """